GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_flash.h
// Field: [12:8] EFUSE_ERRCODE
//
// Same as EFUSEERROR.CODE
#define FLASH_STAT_EFUSE_ERRCODE_M                                  0x00001F00
#define FLASH_STAT_EFUSE_ERRCODE_S                                  8

// Field: [2]    SAMHOLD_DIS
//
// Status indicator of flash sample and hold sequencing logic. This bit will go to
// 1 some delay after CFG.DIS_IDLE is set to 1.
// 0: Not disabled
// 1: Sample and hold disabled and stable
#define FLASH_STAT_SAMHOLD_DIS                                      0x00000004
#define FLASH_STAT_SAMHOLD_DIS_BITN                                 2
#define FLASH_STAT_SAMHOLD_DIS_M                                    0x00000004
#define FLASH_STAT_SAMHOLD_DIS_S                                    2

// Field: [1]    BUSY
//
// Fast version of the FMC FMSTAT.BUSY bit.
// This flag is valid immediately after the operation setting it (FMSTAT.BUSY
// is delayed some cycles)
// 0 : Not busy
// 1 : Busy
#define FLASH_STAT_BUSY                                             0x00000002
#define FLASH_STAT_BUSY_BITN                                        1
#define FLASH_STAT_BUSY_M                                           0x00000002
#define FLASH_STAT_BUSY_S                                           1

// Field: [0]    POWER_MODE
//
// Power state of the flash sub-system.
// 0 : Active
// 1 : Low power
#define FLASH_STAT_POWER_MODE                                       0x00000001
#define FLASH_STAT_POWER_MODE_BITN                                  0
#define FLASH_STAT_POWER_MODE_M                                     0x00000001
#define FLASH_STAT_POWER_MODE_S                                     0

//*****************************************************************************
//
// Register: FLASH_O_CFG
//
//*****************************************************************************
// Field: [8]    STANDBY_MODE_SEL
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_CFG_STANDBY_MODE_SEL                                  0x00000100
#define FLASH_CFG_STANDBY_MODE_SEL_BITN                             8
#define FLASH_CFG_STANDBY_MODE_SEL_M                                0x00000100
#define FLASH_CFG_STANDBY_MODE_SEL_S                                8

// Field: [7:6] STANDBY_PW_SEL
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_CFG_STANDBY_PW_SEL_M                                  0x000000C0
#define FLASH_CFG_STANDBY_PW_SEL_S                                  6

// Field: [5]    DIS_EFUSECLK
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_CFG_DIS_EFUSECLK                                      0x00000020
#define FLASH_CFG_DIS_EFUSECLK_BITN                                 5
#define FLASH_CFG_DIS_EFUSECLK_M                                    0x00000020
#define FLASH_CFG_DIS_EFUSECLK_S                                    5

// Field: [4]    DIS_READACCESS
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_CFG_DIS_READACCESS                                    0x00000010
#define FLASH_CFG_DIS_READACCESS_BITN                               4
#define FLASH_CFG_DIS_READACCESS_M                                  0x00000010
#define FLASH_CFG_DIS_READACCESS_S                                  4

// Field: [3]    ENABLE_SWINTF
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_CFG_ENABLE_SWINTF                                     0x00000008
#define FLASH_CFG_ENABLE_SWINTF_BITN                                3
#define FLASH_CFG_ENABLE_SWINTF_M                                   0x00000008
#define FLASH_CFG_ENABLE_SWINTF_S                                   3

// Field: [1]    DIS_STANDBY
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_CFG_DIS_STANDBY                                       0x00000002
#define FLASH_CFG_DIS_STANDBY_BITN                                  1
#define FLASH_CFG_DIS_STANDBY_M                                     0x00000002
#define FLASH_CFG_DIS_STANDBY_S                                     1

// Field: [0]    DIS_IDLE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_CFG_DIS_IDLE                                          0x00000001
#define FLASH_CFG_DIS_IDLE_BITN                                     0
#define FLASH_CFG_DIS_IDLE_M                                        0x00000001
#define FLASH_CFG_DIS_IDLE_S                                        0

//*****************************************************************************
//
// Register: FLASH_O_SYSCODE_START
//
//*****************************************************************************
// Field: [4:0] SYSCODE_START
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_SYSCODE_START_SYSCODE_START_M                         0x0000001F
#define FLASH_SYSCODE_START_SYSCODE_START_S                         0

//*****************************************************************************
//
// Register: FLASH_O_FLASH_SIZE
//
//*****************************************************************************
// Field: [7:0] SECTORS
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FLASH_SIZE_SECTORS_M                                  0x000000FF
#define FLASH_FLASH_SIZE_SECTORS_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_FWLOCK
//
//*****************************************************************************
// Field: [2:0] FWLOCK
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FWLOCK_FWLOCK_M                                       0x00000007
#define FLASH_FWLOCK_FWLOCK_S                                       0

//*****************************************************************************
//
// Register: FLASH_O_FWFLAG
//
//*****************************************************************************
// Field: [2:0] FWFLAG
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FWFLAG_FWFLAG_M                                       0x00000007
#define FLASH_FWFLAG_FWFLAG_S                                       0

//*****************************************************************************
//
// Register: FLASH_O_EFUSE
//
//*****************************************************************************
// Field: [28:24] INSTRUCTION
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSE_INSTRUCTION_M                                   0x1F000000
#define FLASH_EFUSE_INSTRUCTION_S                                   24

// Field: [15:0] DUMPWORD
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSE_DUMPWORD_M                                      0x0000FFFF
#define FLASH_EFUSE_DUMPWORD_S                                      0

//*****************************************************************************
//
// Register: FLASH_O_EFUSEADDR
//
//*****************************************************************************
// Field: [15:11] BLOCK
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEADDR_BLOCK_M                                     0x0000F800
#define FLASH_EFUSEADDR_BLOCK_S                                     11

// Field: [10:0] ROW
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEADDR_ROW_M                                       0x000007FF
#define FLASH_EFUSEADDR_ROW_S                                       0

//*****************************************************************************
//
// Register: FLASH_O_DATAUPPER
//
//*****************************************************************************
// Field: [7:3] SPARE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_DATAUPPER_SPARE_M                                     0x000000F8
#define FLASH_DATAUPPER_SPARE_S                                     3

// Field: [2]    P
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_DATAUPPER_P                                           0x00000004
#define FLASH_DATAUPPER_P_BITN                                      2
#define FLASH_DATAUPPER_P_M                                         0x00000004
#define FLASH_DATAUPPER_P_S                                         2

// Field: [1]    R
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_DATAUPPER_R                                           0x00000002
#define FLASH_DATAUPPER_R_BITN                                      1
#define FLASH_DATAUPPER_R_M                                         0x00000002
#define FLASH_DATAUPPER_R_S                                         1

