GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_flash.h
// Field: [0]    EEN
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_DATAUPPER_EEN                                         0x00000001
#define FLASH_DATAUPPER_EEN_BITN                                    0
#define FLASH_DATAUPPER_EEN_M                                       0x00000001
#define FLASH_DATAUPPER_EEN_S                                       0

//*****************************************************************************
//
// Register: FLASH_O_DATALOWER
//
//*****************************************************************************
// Field: [31:0] DATA
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_DATALOWER_DATA_M                                      0xFFFFFFFF
#define FLASH_DATALOWER_DATA_S                                      0

//*****************************************************************************
//
// Register: FLASH_O_EFUSECFG
//
//*****************************************************************************
// Field: [8]    IDLEGATING
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSECFG_IDLEGATING                                   0x00000100
#define FLASH_EFUSECFG_IDLEGATING_BITN                              8
#define FLASH_EFUSECFG_IDLEGATING_M                                 0x00000100
#define FLASH_EFUSECFG_IDLEGATING_S                                 8

// Field: [4:3] SLAVEPOWER
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSECFG_SLAVEPOWER_M                                 0x00000018
#define FLASH_EFUSECFG_SLAVEPOWER_S                                 3

// Field: [0]    GATING
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSECFG_GATING                                       0x00000001
#define FLASH_EFUSECFG_GATING_BITN                                  0
#define FLASH_EFUSECFG_GATING_M                                     0x00000001
#define FLASH_EFUSECFG_GATING_S                                     0

//*****************************************************************************
//
// Register: FLASH_O_EFUSESTAT
//
//*****************************************************************************
// Field: [0]    RESETDONE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSESTAT_RESETDONE                                   0x00000001
#define FLASH_EFUSESTAT_RESETDONE_BITN                              0
#define FLASH_EFUSESTAT_RESETDONE_M                                 0x00000001
#define FLASH_EFUSESTAT_RESETDONE_S                                 0

//*****************************************************************************
//
// Register: FLASH_O_ACC
//
//*****************************************************************************
// Field: [23:0] ACCUMULATOR
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_ACC_ACCUMULATOR_M                                     0x00FFFFFF
#define FLASH_ACC_ACCUMULATOR_S                                     0

//*****************************************************************************
//
// Register: FLASH_O_BOUNDARY
//
//*****************************************************************************
// Field: [23]    DISROW0
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_BOUNDARY_DISROW0                                      0x00800000
#define FLASH_BOUNDARY_DISROW0_BITN                                 23
#define FLASH_BOUNDARY_DISROW0_M                                    0x00800000
#define FLASH_BOUNDARY_DISROW0_S                                    23

// Field: [22]    SPARE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_BOUNDARY_SPARE                                        0x00400000
#define FLASH_BOUNDARY_SPARE_BITN                                   22
#define FLASH_BOUNDARY_SPARE_M                                      0x00400000
#define FLASH_BOUNDARY_SPARE_S                                      22

// Field: [21]    EFC_SELF_TEST_ERROR
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_BOUNDARY_EFC_SELF_TEST_ERROR                          0x00200000
#define FLASH_BOUNDARY_EFC_SELF_TEST_ERROR_BITN                     21
#define FLASH_BOUNDARY_EFC_SELF_TEST_ERROR_M                        0x00200000
#define FLASH_BOUNDARY_EFC_SELF_TEST_ERROR_S                        21

// Field: [20]    EFC_INSTRUCTION_INFO
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_BOUNDARY_EFC_INSTRUCTION_INFO                         0x00100000
#define FLASH_BOUNDARY_EFC_INSTRUCTION_INFO_BITN                    20
#define FLASH_BOUNDARY_EFC_INSTRUCTION_INFO_M                       0x00100000
#define FLASH_BOUNDARY_EFC_INSTRUCTION_INFO_S                       20

// Field: [19]    EFC_INSTRUCTION_ERROR
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_BOUNDARY_EFC_INSTRUCTION_ERROR                        0x00080000
#define FLASH_BOUNDARY_EFC_INSTRUCTION_ERROR_BITN                   19
#define FLASH_BOUNDARY_EFC_INSTRUCTION_ERROR_M                      0x00080000
#define FLASH_BOUNDARY_EFC_INSTRUCTION_ERROR_S                      19

// Field: [18]    EFC_AUTOLOAD_ERROR
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_BOUNDARY_EFC_AUTOLOAD_ERROR                           0x00040000
#define FLASH_BOUNDARY_EFC_AUTOLOAD_ERROR_BITN                      18
#define FLASH_BOUNDARY_EFC_AUTOLOAD_ERROR_M                         0x00040000
#define FLASH_BOUNDARY_EFC_AUTOLOAD_ERROR_S                         18

// Field: [17:14] OUTPUTENABLE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_BOUNDARY_OUTPUTENABLE_M                               0x0003C000
#define FLASH_BOUNDARY_OUTPUTENABLE_S                               14

// Field: [13]    YS_ECC_SELF_TEST_EN
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_BOUNDARY_YS_ECC_SELF_TEST_EN                          0x00002000
#define FLASH_BOUNDARY_YS_ECC_SELF_TEST_EN_BITN                     13
#define FLASH_BOUNDARY_YS_ECC_SELF_TEST_EN_M                        0x00002000
#define FLASH_BOUNDARY_YS_ECC_SELF_TEST_EN_S                        13

// Field: [12]    SYS_ECC_OVERRIDE_EN
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_BOUNDARY_SYS_ECC_OVERRIDE_EN                          0x00001000
#define FLASH_BOUNDARY_SYS_ECC_OVERRIDE_EN_BITN                     12
#define FLASH_BOUNDARY_SYS_ECC_OVERRIDE_EN_M                        0x00001000
#define FLASH_BOUNDARY_SYS_ECC_OVERRIDE_EN_S                        12

