GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_flash.h
// Field: [11]    EFC_FDI
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_BOUNDARY_EFC_FDI                                      0x00000800
#define FLASH_BOUNDARY_EFC_FDI_BITN                                 11
#define FLASH_BOUNDARY_EFC_FDI_M                                    0x00000800
#define FLASH_BOUNDARY_EFC_FDI_S                                    11

// Field: [10]    SYS_DIEID_AUTOLOAD_EN
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_BOUNDARY_SYS_DIEID_AUTOLOAD_EN                        0x00000400
#define FLASH_BOUNDARY_SYS_DIEID_AUTOLOAD_EN_BITN                   10
#define FLASH_BOUNDARY_SYS_DIEID_AUTOLOAD_EN_M                      0x00000400
#define FLASH_BOUNDARY_SYS_DIEID_AUTOLOAD_EN_S                      10

// Field: [9:8] SYS_REPAIR_EN
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_BOUNDARY_SYS_REPAIR_EN_M                              0x00000300
#define FLASH_BOUNDARY_SYS_REPAIR_EN_S                              8

// Field: [7:4] SYS_WS_READ_STATES
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_BOUNDARY_SYS_WS_READ_STATES_M                         0x000000F0
#define FLASH_BOUNDARY_SYS_WS_READ_STATES_S                         4

// Field: [3:0] INPUTENABLE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_BOUNDARY_INPUTENABLE_M                                0x0000000F
#define FLASH_BOUNDARY_INPUTENABLE_S                                0

//*****************************************************************************
//
// Register: FLASH_O_EFUSEFLAG
//
//*****************************************************************************
// Field: [0]    KEY
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEFLAG_KEY                                         0x00000001
#define FLASH_EFUSEFLAG_KEY_BITN                                    0
#define FLASH_EFUSEFLAG_KEY_M                                       0x00000001
#define FLASH_EFUSEFLAG_KEY_S                                       0

//*****************************************************************************
//
// Register: FLASH_O_EFUSEKEY
//
//*****************************************************************************
// Field: [31:0] CODE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEKEY_CODE_M                                       0xFFFFFFFF
#define FLASH_EFUSEKEY_CODE_S                                       0

//*****************************************************************************
//
// Register: FLASH_O_EFUSERELEASE
//
//*****************************************************************************
// Field: [31:25] ODPYEAR
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSERELEASE_ODPYEAR_M                                0xFE000000
#define FLASH_EFUSERELEASE_ODPYEAR_S                                25

// Field: [24:21] ODPMONTH
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSERELEASE_ODPMONTH_M                               0x01E00000
#define FLASH_EFUSERELEASE_ODPMONTH_S                               21

// Field: [20:16] ODPDAY
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSERELEASE_ODPDAY_M                                 0x001F0000
#define FLASH_EFUSERELEASE_ODPDAY_S                                 16

// Field: [15:9] EFUSEYEAR
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSERELEASE_EFUSEYEAR_M                              0x0000FE00
#define FLASH_EFUSERELEASE_EFUSEYEAR_S                              9

// Field: [8:5] EFUSEMONTH
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSERELEASE_EFUSEMONTH_M                             0x000001E0
#define FLASH_EFUSERELEASE_EFUSEMONTH_S                             5

// Field: [4:0] EFUSEDAY
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSERELEASE_EFUSEDAY_M                               0x0000001F
#define FLASH_EFUSERELEASE_EFUSEDAY_S                               0

//*****************************************************************************
//
// Register: FLASH_O_EFUSEPINS
//
//*****************************************************************************
// Field: [15]    EFC_SELF_TEST_DONE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEPINS_EFC_SELF_TEST_DONE                          0x00008000
#define FLASH_EFUSEPINS_EFC_SELF_TEST_DONE_BITN                     15
#define FLASH_EFUSEPINS_EFC_SELF_TEST_DONE_M                        0x00008000
#define FLASH_EFUSEPINS_EFC_SELF_TEST_DONE_S                        15

// Field: [14]    EFC_SELF_TEST_ERROR
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEPINS_EFC_SELF_TEST_ERROR                         0x00004000
#define FLASH_EFUSEPINS_EFC_SELF_TEST_ERROR_BITN                    14
#define FLASH_EFUSEPINS_EFC_SELF_TEST_ERROR_M                       0x00004000
#define FLASH_EFUSEPINS_EFC_SELF_TEST_ERROR_S                       14

// Field: [13]    SYS_ECC_SELF_TEST_EN
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEPINS_SYS_ECC_SELF_TEST_EN                        0x00002000
#define FLASH_EFUSEPINS_SYS_ECC_SELF_TEST_EN_BITN                   13
#define FLASH_EFUSEPINS_SYS_ECC_SELF_TEST_EN_M                      0x00002000
#define FLASH_EFUSEPINS_SYS_ECC_SELF_TEST_EN_S                      13

// Field: [12]    EFC_INSTRUCTION_INFO
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEPINS_EFC_INSTRUCTION_INFO                        0x00001000
#define FLASH_EFUSEPINS_EFC_INSTRUCTION_INFO_BITN                   12
#define FLASH_EFUSEPINS_EFC_INSTRUCTION_INFO_M                      0x00001000
#define FLASH_EFUSEPINS_EFC_INSTRUCTION_INFO_S                      12

// Field: [11]    EFC_INSTRUCTION_ERROR
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEPINS_EFC_INSTRUCTION_ERROR                       0x00000800
#define FLASH_EFUSEPINS_EFC_INSTRUCTION_ERROR_BITN                  11
#define FLASH_EFUSEPINS_EFC_INSTRUCTION_ERROR_M                     0x00000800
#define FLASH_EFUSEPINS_EFC_INSTRUCTION_ERROR_S                     11

// Field: [10]    EFC_AUTOLOAD_ERROR
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEPINS_EFC_AUTOLOAD_ERROR                          0x00000400
#define FLASH_EFUSEPINS_EFC_AUTOLOAD_ERROR_BITN                     10
#define FLASH_EFUSEPINS_EFC_AUTOLOAD_ERROR_M                        0x00000400
#define FLASH_EFUSEPINS_EFC_AUTOLOAD_ERROR_S                        10

// Field: [9]    SYS_ECC_OVERRIDE_EN
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEPINS_SYS_ECC_OVERRIDE_EN                         0x00000200
#define FLASH_EFUSEPINS_SYS_ECC_OVERRIDE_EN_BITN                    9
#define FLASH_EFUSEPINS_SYS_ECC_OVERRIDE_EN_M                       0x00000200
#define FLASH_EFUSEPINS_SYS_ECC_OVERRIDE_EN_S                       9

// Field: [8]    EFC_READY
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEPINS_EFC_READY                                   0x00000100
#define FLASH_EFUSEPINS_EFC_READY_BITN                              8
#define FLASH_EFUSEPINS_EFC_READY_M                                 0x00000100
#define FLASH_EFUSEPINS_EFC_READY_S                                 8

// Field: [7]    EFC_FCLRZ
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEPINS_EFC_FCLRZ                                   0x00000080
#define FLASH_EFUSEPINS_EFC_FCLRZ_BITN                              7
#define FLASH_EFUSEPINS_EFC_FCLRZ_M                                 0x00000080
#define FLASH_EFUSEPINS_EFC_FCLRZ_S                                 7

// Field: [6]    SYS_DIEID_AUTOLOAD_EN
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_EFUSEPINS_SYS_DIEID_AUTOLOAD_EN                       0x00000040
#define FLASH_EFUSEPINS_SYS_DIEID_AUTOLOAD_EN_BITN                  6
#define FLASH_EFUSEPINS_SYS_DIEID_AUTOLOAD_EN_M                     0x00000040
#define FLASH_EFUSEPINS_SYS_DIEID_AUTOLOAD_EN_S                     6

