GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_flash.h
// Field: [7:4] TRIM13_PV
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FVHVCT1_TRIM13_PV_M                                   0x000000F0
#define FLASH_FVHVCT1_TRIM13_PV_S                                   4

// Field: [3:0] VHVCT_PV
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FVHVCT1_VHVCT_PV_M                                    0x0000000F
#define FLASH_FVHVCT1_VHVCT_PV_S                                    0

//*****************************************************************************
//
// Register: FLASH_O_FVHVCT2
//
//*****************************************************************************
// Field: [23:20] TRIM13_P
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FVHVCT2_TRIM13_P_M                                    0x00F00000
#define FLASH_FVHVCT2_TRIM13_P_S                                    20

// Field: [19:16] VHVCT_P
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FVHVCT2_VHVCT_P_M                                     0x000F0000
#define FLASH_FVHVCT2_VHVCT_P_S                                     16

//*****************************************************************************
//
// Register: FLASH_O_FVHVCT3
//
//*****************************************************************************
// Field: [19:16] WCT
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FVHVCT3_WCT_M                                         0x000F0000
#define FLASH_FVHVCT3_WCT_S                                         16

// Field: [3:0] VHVCT_READ
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FVHVCT3_VHVCT_READ_M                                  0x0000000F
#define FLASH_FVHVCT3_VHVCT_READ_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_FVNVCT
//
//*****************************************************************************
// Field: [12:8] VCG2P5CT
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FVNVCT_VCG2P5CT_M                                     0x00001F00
#define FLASH_FVNVCT_VCG2P5CT_S                                     8

// Field: [4:0] VIN_CT
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FVNVCT_VIN_CT_M                                       0x0000001F
#define FLASH_FVNVCT_VIN_CT_S                                       0

//*****************************************************************************
//
// Register: FLASH_O_FVSLP
//
//*****************************************************************************
// Field: [15:12] VSL_P
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FVSLP_VSL_P_M                                         0x0000F000
#define FLASH_FVSLP_VSL_P_S                                         12

//*****************************************************************************
//
// Register: FLASH_O_FVWLCT
//
//*****************************************************************************
// Field: [4:0] VWLCT_P
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FVWLCT_VWLCT_P_M                                      0x0000001F
#define FLASH_FVWLCT_VWLCT_P_S                                      0

//*****************************************************************************
//
// Register: FLASH_O_FEFUSECTL
//
//*****************************************************************************
// Field: [26:24] CHAIN_SEL
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FEFUSECTL_CHAIN_SEL_M                                 0x07000000
#define FLASH_FEFUSECTL_CHAIN_SEL_S                                 24

// Field: [17]    WRITE_EN
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FEFUSECTL_WRITE_EN                                    0x00020000
#define FLASH_FEFUSECTL_WRITE_EN_BITN                               17
#define FLASH_FEFUSECTL_WRITE_EN_M                                  0x00020000
#define FLASH_FEFUSECTL_WRITE_EN_S                                  17

// Field: [16]    BP_SEL
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FEFUSECTL_BP_SEL                                      0x00010000
#define FLASH_FEFUSECTL_BP_SEL_BITN                                 16
#define FLASH_FEFUSECTL_BP_SEL_M                                    0x00010000
#define FLASH_FEFUSECTL_BP_SEL_S                                    16

// Field: [8]    EF_CLRZ
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FEFUSECTL_EF_CLRZ                                     0x00000100
#define FLASH_FEFUSECTL_EF_CLRZ_BITN                                8
#define FLASH_FEFUSECTL_EF_CLRZ_M                                   0x00000100
#define FLASH_FEFUSECTL_EF_CLRZ_S                                   8

// Field: [4]    EF_TEST
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FEFUSECTL_EF_TEST                                     0x00000010
#define FLASH_FEFUSECTL_EF_TEST_BITN                                4
#define FLASH_FEFUSECTL_EF_TEST_M                                   0x00000010
#define FLASH_FEFUSECTL_EF_TEST_S                                   4

// Field: [3:0] EFUSE_EN
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FEFUSECTL_EFUSE_EN_M                                  0x0000000F
#define FLASH_FEFUSECTL_EFUSE_EN_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_FEFUSESTAT
//
//*****************************************************************************
// Field: [0]    SHIFT_DONE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FEFUSESTAT_SHIFT_DONE                                 0x00000001
#define FLASH_FEFUSESTAT_SHIFT_DONE_BITN                            0
#define FLASH_FEFUSESTAT_SHIFT_DONE_M                               0x00000001
#define FLASH_FEFUSESTAT_SHIFT_DONE_S                               0

//*****************************************************************************
//
// Register: FLASH_O_FEFUSEDATA
//
//*****************************************************************************
// Field: [31:0] FEFUSEDATA
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FEFUSEDATA_FEFUSEDATA_M                               0xFFFFFFFF
#define FLASH_FEFUSEDATA_FEFUSEDATA_S                               0

//*****************************************************************************
//
// Register: FLASH_O_FSEQPMP
//
//*****************************************************************************
// Field: [27:24] TRIM_3P4
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSEQPMP_TRIM_3P4_M                                    0x0F000000
#define FLASH_FSEQPMP_TRIM_3P4_S                                    24

// Field: [21:20] TRIM_1P7
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSEQPMP_TRIM_1P7_M                                    0x00300000
#define FLASH_FSEQPMP_TRIM_1P7_S                                    20

// Field: [19:16] TRIM_0P8
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSEQPMP_TRIM_0P8_M                                    0x000F0000
#define FLASH_FSEQPMP_TRIM_0P8_S                                    16

