GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_flash.h
// Field: [14]    ONE_TIME_GOOD
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_ST_MACHINE_ONE_TIME_GOOD                          0x00004000
#define FLASH_FSM_ST_MACHINE_ONE_TIME_GOOD_BITN                     14
#define FLASH_FSM_ST_MACHINE_ONE_TIME_GOOD_M                        0x00004000
#define FLASH_FSM_ST_MACHINE_ONE_TIME_GOOD_S                        14

// Field: [11]    DO_REDU_COL
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_ST_MACHINE_DO_REDU_COL                            0x00000800
#define FLASH_FSM_ST_MACHINE_DO_REDU_COL_BITN                       11
#define FLASH_FSM_ST_MACHINE_DO_REDU_COL_M                          0x00000800
#define FLASH_FSM_ST_MACHINE_DO_REDU_COL_S                          11

// Field: [10:7] DBG_SHORT_ROW
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_ST_MACHINE_DBG_SHORT_ROW_M                        0x00000780
#define FLASH_FSM_ST_MACHINE_DBG_SHORT_ROW_S                        7

// Field: [5]    PGM_SEC_COF_EN
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_ST_MACHINE_PGM_SEC_COF_EN                         0x00000020
#define FLASH_FSM_ST_MACHINE_PGM_SEC_COF_EN_BITN                    5
#define FLASH_FSM_ST_MACHINE_PGM_SEC_COF_EN_M                       0x00000020
#define FLASH_FSM_ST_MACHINE_PGM_SEC_COF_EN_S                       5

// Field: [4]    PREC_STOP_EN
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_ST_MACHINE_PREC_STOP_EN                           0x00000010
#define FLASH_FSM_ST_MACHINE_PREC_STOP_EN_BITN                      4
#define FLASH_FSM_ST_MACHINE_PREC_STOP_EN_M                         0x00000010
#define FLASH_FSM_ST_MACHINE_PREC_STOP_EN_S                         4

// Field: [3]    DIS_TST_EN
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_ST_MACHINE_DIS_TST_EN                             0x00000008
#define FLASH_FSM_ST_MACHINE_DIS_TST_EN_BITN                        3
#define FLASH_FSM_ST_MACHINE_DIS_TST_EN_M                           0x00000008
#define FLASH_FSM_ST_MACHINE_DIS_TST_EN_S                           3

// Field: [2]    CMD_EN
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_ST_MACHINE_CMD_EN                                 0x00000004
#define FLASH_FSM_ST_MACHINE_CMD_EN_BITN                            2
#define FLASH_FSM_ST_MACHINE_CMD_EN_M                               0x00000004
#define FLASH_FSM_ST_MACHINE_CMD_EN_S                               2

// Field: [1]    INV_DATA
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_ST_MACHINE_INV_DATA                               0x00000002
#define FLASH_FSM_ST_MACHINE_INV_DATA_BITN                          1
#define FLASH_FSM_ST_MACHINE_INV_DATA_M                             0x00000002
#define FLASH_FSM_ST_MACHINE_INV_DATA_S                             1

// Field: [0]    OVERRIDE
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_ST_MACHINE_OVERRIDE                               0x00000001
#define FLASH_FSM_ST_MACHINE_OVERRIDE_BITN                          0
#define FLASH_FSM_ST_MACHINE_OVERRIDE_M                             0x00000001
#define FLASH_FSM_ST_MACHINE_OVERRIDE_S                             0

//*****************************************************************************
//
// Register: FLASH_O_FSM_FLES
//
//*****************************************************************************
// Field: [11:8] BLK_TIOTP
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_FLES_BLK_TIOTP_M                                  0x00000F00
#define FLASH_FSM_FLES_BLK_TIOTP_S                                  8

// Field: [7:0] BLK_OTP
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_FLES_BLK_OTP_M                                    0x000000FF
#define FLASH_FSM_FLES_BLK_OTP_S                                    0

//*****************************************************************************
//
// Register: FLASH_O_FSM_WR_ENA
//
//*****************************************************************************
// Field: [2:0] WR_ENA
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_WR_ENA_WR_ENA_M                                   0x00000007
#define FLASH_FSM_WR_ENA_WR_ENA_S                                   0

//*****************************************************************************
//
// Register: FLASH_O_FSM_ACC_PP
//
//*****************************************************************************
// Field: [31:0] FSM_ACC_PP
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_ACC_PP_FSM_ACC_PP_M                               0xFFFFFFFF
#define FLASH_FSM_ACC_PP_FSM_ACC_PP_S                               0

//*****************************************************************************
//
// Register: FLASH_O_FSM_ACC_EP
//
//*****************************************************************************
// Field: [15:0] ACC_EP
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_ACC_EP_ACC_EP_M                                   0x0000FFFF
#define FLASH_FSM_ACC_EP_ACC_EP_S                                   0

//*****************************************************************************
//
// Register: FLASH_O_FSM_ADDR
//
//*****************************************************************************
// Field: [30:28] BANK
//
// Internal Register. Customers can control this through TI provided API
#define FLASH_FSM_ADDR_BANK_M                                       0x70000000
#define FLASH_FSM_ADDR_BANK_S                                       28

